---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarContainerType
source: html/944b0bbc-92e0-123f-12c8-a01feca40e72.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerType

Represents a Rebar Container Type, used in the generation of Rebar Container.

## Syntax (C#)
```csharp
public class RebarContainerType : ElementType
```